---
kind: method
id: M:Autodesk.Revit.DB.AnnotationSymbol.duplicate
source: html/272c1e6e-c696-24fe-52e5-26bcb961f815.htm
---
# Autodesk.Revit.DB.AnnotationSymbol.duplicate Method

Duplicate this annotation symbol.

## Syntax (C#)
```csharp
public AnnotationSymbol duplicate()
```

## Returns
Pointer to the new annotation symbol.